Autodesk.Revit.DB.ConnectorType.MainSurface
Main surface connection type

Autodesk.Revit.DB.ConnectorType.MasterSurface
This value is deprecated and will be removed in a future version of Revit. Please use MainSurface instead.